<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Alert Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain alert messages for various scenarios
    | during CRUD operations. You are free to modify these language lines
    | according to your application's requirements.
    |
    */

    'backend' => [
        'access' => [
            'roles' => [
                'created' => 'نقش با موفقیت ساخته شد.',
                'updated' => 'نقش با موفقیت بروزرسانی شد.',
                'deleted' => 'نقش با موفقیت حذف شد.',
            ],

            'permissions' => [
                'created' => 'دسترسی با موفقیت ساخته شد.',
                'updated' => 'دسترسی با موفقیت بروزرسانی شد.',
                'deleted' => 'دسترسی با موفقیت حذف شد.',
            ],

            'users' => [
                'created' => 'کاربر با موفقیت ساخته شد.',
                'updated' => 'کاربر با موفقیت بروزرسانی شد.',
                'deleted' => 'کاربر با موفقیت حذف شد.',
                'deleted_permanently' => 'کاربر برای همیشه حذف شد.',
                'restored' => 'کاربر با موفقیت بازیابی شد.',
                'cant_resend_confirmation' => 'این برنامه در حال حاضر برای تأیید دستی کاربران تنظیم شده است.',
                'confirmation_email' => 'ایمیل تأیید جدید به آدرس موجود در پرونده ارسال شده است.',
                'confirmed' => 'کاربر با موفقیت تأیید شد.',
                'session_cleared' => "جلسه کاربر با موفقیت پاک شد.",
                'social_deleted' => 'حساب اجتماعی با موفقیت حذف شد.',
                'unconfirmed' => 'کاربر با موفقیت تأیید نشد.',
                'updated_password' => "رمز ورود کاربر با موفقیت به روز شد.",
            ],
        ],

        'blogs' => [
            'created' => 'وبلاگ با موفقیت ایجاد شد.',
            'updated' => 'وبلاگ با موفقیت به روز شد.',
            'deleted' => 'وبلاگ با موفقیت حذف شد.',
        ],

        'blog-category' => [
            'created' => 'دسته وبلاگ با موفقیت ایجاد شد.',
            'updated' => 'دسته وبلاگ با موفقیت بروز شد.',
            'deleted' => 'دسته وبلاگ با موفقیت حذف شد.',
        ],

        'blog-tags' => [
            'created' => 'برچسب وبلاگ با موفقیت ایجاد شد.',
            'updated' => 'برچسب وبلاگ با موفقیت بروز شد.',
            'deleted' => 'برچسب وبلاگ با موفقیت حذف شد.',
        ],

        'pages' => [
            'created' => 'صفحه با موفقیت ایجاد شد.',
            'updated' => 'صفحه با موفقیت بروز شد.',
            'deleted' => 'صفحه با موفقیت حذف شد.',
        ],

        'faqs' => [
            'created' => 'پرسش و پاسخ با موفقیت ایجاد شد.',
            'updated' => 'پرسش و پاسخ با موفقیت بروز شد.',
            'deleted' => 'پرسش و پاسخ با موفقیت حذف شد.',
        ],

        'email-templates' => [
            'created' => 'الگوی ایمیل با موفقیت ایجاد شد.',
            'updated' => 'الگوی ایمیل با موفقیت بروز شد.',
            'deleted' => 'الگوی ایمیل با موفقیت حذف شد.',
        ],
    ],

    'frontend' => [
        'contact' => [
            'sent' => 'اطلاعات شما با موفقیت ارسال شد ما در اسرع وقت به ایمیل ارائه شده پاسخ خواهیم داد.',
        ],
    ],
];
