<?php

return [
    'messages' => [
        'registration' => [
            'success' => 'لقد سجلت بنجاح. يرجى التحقق من بريدك الإلكتروني للتفعيل',
        ],
        'login' => [
            'success' => 'نجاح تسجيل الدخول.',
            'failed' => 'بيانات الاعتماد غير صالحة! حاول مرة اخرى.',
        ],
        'logout' => [
            'success' => 'تم تسجيل الخروج بنجاح.',
        ],
        'forgot_password' => [
            'success' => 'لقد أرسلنا البريد الإلكتروني مع رابط إعادة تعيين كلمة المرور. يرجى التحقق من البريد الوارد الخاص بك!.',
            'validation' => [
                'email_not_found' => 'هذا البريد الإلكترونى ليس مسجلا.',
            ],
        ],
        'refresh' => [
            'token' => [
                'not_provided' => 'لم يتم توفير الرمز.',
            ],
            'status' => 'حسنا',
        ],
    ],
];
